blog/2021/nginx-1st.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 12:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nginx 初次使用</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Nginx 初次使用</h1>
</header>
<div id="outline-container-orgf484c03" class="outline-2">
<h2 id="orgf484c03">下载</h2>
<div class="outline-text-2" id="text-orgf484c03">
<p>
我使用 Arch Linux
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pacman -S nginx
</pre>
</div>
</div>
</div>

<div id="outline-container-org56828de" class="outline-2">
<h2 id="org56828de">初学者指南</h2>
<div class="outline-text-2" id="text-org56828de">
<p>
<a href="http://nginx.org/en/docs/beginners_guide.html">http://nginx.org/en/docs/beginners_guide.html</a>
</p>

<p>
介绍 + 一些简单操作：
</p>

<ul class="org-ul">
<li>打开关闭 Nginx</li>
<li>重新加载配置</li>
<li>解释配置文件的结构</li>
<li>设置 Nginx 为静态内容提供服务</li>
<li>将 Nginx 配置为代理服务器（Nginx 本身是代理服务器还是安装并配置好
Nginx 的计算机是代理服务器）</li>
<li>将它与 FastCGI 应用程序连接</li>
</ul>
</div>

<div id="outline-container-orgf9fd785" class="outline-3">
<h3 id="orgf9fd785">打开关闭 Nginx，重新加载配置</h3>
<div class="outline-text-3" id="text-orgf9fd785">
<div class="org-src-container">
<pre class="src src-sh">sudo nginx <span style="color: #706565;"># </span><span style="color: #857575;">start</span>
sudo nginx stop <span style="color: #706565;"># </span><span style="color: #857575;">fast shutdown</span>
sudo nginx quit <span style="color: #706565;"># </span><span style="color: #857575;">graceful shutdown</span>

<span style="color: #706565;"># </span><span style="color: #857575;">if modify the configuration file, need reload nginx</span>
sudo nginx -s reload <span style="color: #706565;"># </span><span style="color: #857575;">reload</span>

<span style="color: #706565;"># </span><span style="color: #857575;">list all running nginx processes</span>
ps -ax | grep nginx
</pre>
</div>

<p>
配置文件的结构
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #ad8572;">name</span> {
  key: value;
  <span style="color: #706565;"># </span><span style="color: #857575;">comment</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d3f80e" class="outline-3">
<h3 id="org8d3f80e">设置 Nginx 为静态内容提供服务</h3>
<div class="outline-text-3" id="text-org8d3f80e">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #706565;"># </span><span style="color: #857575;">edit /etc/nginx/nginx.conf</span>
<span style="color: #ad8572;">http</span> {
  <span style="color: #ad8572;">server</span> {
    <span style="color: #ad8572;">location /</span> {
      root /usr/share/nginx/html;
      index index.html index.htm;
    }
    error_page 500 502 503 504 /50x.html;
    <span style="color: #aaca86;">location</span> = /50x.html {
      root /usr/share/nginx/html;
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeacc4d3" class="outline-3">
<h3 id="orgeacc4d3">将 Nginx 配置为代理服务器</h3>
<div class="outline-text-3" id="text-orgeacc4d3">
<p>
将它与 FastCGI 应用程序连接
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #ad8572;">server</span> {
  <span style="color: #ad8572;">location /</span> {
    fastcgi_pass  localhost:9000;
    fastcgi_param SCRIPT_FILENAME $document_root$fastcgi_script_name;
    fastcgi_param QUERY_STRING    $query_string;
  }

  <span style="color: #ad8572;">location ~ \.(gif|jpg|png)$</span> {
    root /data/images;
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9ee835" class="outline-2">
<h2 id="orgf9ee835">使用中的报错</h2>
<div class="outline-text-2" id="text-orgf9ee835">
</div>
<div id="outline-container-orgf8374c4" class="outline-3">
<h3 id="orgf8374c4">could not build optimal types_hash</h3>
<div class="outline-text-3" id="text-orgf8374c4">
<div class="org-src-container">
<pre class="src src-sh">sudo nginx
2021/09/19 08:55:04 [warn] 33400#33400: could not build optimal types_hash, you should increase either types_hash_max_size: 1024 or types_hash_bucket_size: 64; ignoring types_hash_bucket_size
</pre>
</div>

<p>
Solution<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #706565;"># </span><span style="color: #857575;">/etc/nginx/nginx.conf</span>
<span style="color: #ad8572;">http</span> {
  types_hash_max_size 4096;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0f652f" class="outline-3">
<h3 id="orgb0f652f">Address already in use</h3>
<div class="outline-text-3" id="text-orgb0f652f">
<div class="org-src-container">
<pre class="src src-sh">[emerg] 34338#34338: bind() to 0.0.0.0:80 failed (98: Address already<span style="color: #91a0b3;"> in</span> use)
</pre>
</div>

<p>
Solution<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pkill -f nginx &amp; <span style="color: #9fbfdf;">wait</span> $<span style="color: #aaca86;">!</span>
sudo systemctl start nginx
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://wiki.archlinux.org/title/nginx#Configuration_example">https://wiki.archlinux.org/title/nginx#Configuration_example</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://stackoverflow.com/a/51664874">https://stackoverflow.com/a/51664874</a></p></div></div>


</div>
</div></div>
</body>
</html>